<a href="https://colab.research.google.com/github/gyujin0450/RPRG_PartII/blob/master/p215_%ED%8C%8C%EC%83%9D%EB%B3%80%EC%88%98.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#ch07.7 파생변수

In [ ]:
# 파생변수를 생성하는 방법
# 1) 사칙연산 -> 예) 성적 분포를 나타내는 데이터에서 과목별 점수에 대한 총점, 평균 등 연산
# 2) 1:1 관계로 나열 -> 예) 한 컬럼의 속성값을 컬럼명으로 변환하여 "추론통계분석이나 에측분석에서 독립변수로 활용"

In [6]:
user_data <- read.csv("user_data.csv", header = TRUE, fileEncoding = "CP949", encoding = "UTF-8" ) 
head(user_data)

  user_id age house_type resident job
1 1001    35  4          전북     6
2 1002    45  4          경남     2
3 1003    55  4          경기     6
4 1004    43  3          대전     1
5 1005    55  4          경기     2
6 1006    45  1          대구     1

In [7]:
str(user_data)

'data.frame':	400 obs. of  5 variables:
 $ user_id   : int  1001 1002 1003 1004 1005 1006 1007 1008 1009 1010 ...
 $ age       : int  35 45 55 43 55 45 39 55 33 55 ...
 $ house_type: int  4 4 4 3 4 1 4 2 4 3 ...
 $ resident  : chr  "전북" "경남" "경기" "대전" ...
 $ job       : int  6 2 6 1 2 1 1 6 3 6 ...

In [9]:
summary(user_data)

    user_id          age          house_type      resident
 Min.   :1001   Min.   : 6.00   Min.   :1.000   Length:400
 1st Qu.:1101   1st Qu.:48.00   1st Qu.:3.750   Class :character
 Median :1200   Median :52.00   Median :4.000   Mode  :character
 Mean   :1200   Mean   :49.37   Mean   :3.473
 3rd Qu.:1300   3rd Qu.:56.00   3rd Qu.:4.000
 Max.   :1400   Max.   :66.00   Max.   :4.000
      job
 Min.   :1.000
 1st Qu.:2.000
 Median :3.000
 Mean   :3.422
 3rd Qu.:5.000
 Max.   :8.000

In [8]:
table(user_data$house_type)

  1   2   3   4
 32  47  21 300

In [15]:
# 더미변수 생성 및 파생변수 추가
user_data$house_type2 <- ifelse(user_data$house_type == 1 | user_data$house_type == 2, 0, 1)
# house_type2[1:10]

In [16]:
# user_data$house_type2 <- house_type2
head(user_data)

  user_id age house_type resident job house_type2
1 1001    35  4          전북     6   1
2 1002    45  4          경남     2   1
3 1003    55  4          경기     6   1
4 1004    43  3          대전     1   1
5 1005    55  4          경기     2   1
6 1006    45  1          대구     1   0

In [18]:
# 1:1 관계로 파생변수 생성
pay_data <- read.csv("pay_data.csv", header = T, fileEncoding = "CP949", encoding = "UTF-8")
head(pay_data)

  user_id product_type pay_method price
1 1001    1            1.현금     153000
2 1002    2            2.직불카드 120000
3 1003    3            3.신용카드 780000
4 1003    4            3.신용카드 123000
5 1003    5            3.신용카드  79000
6 1003    1            3.신용카드 125000

In [19]:
str(pay_data)

'data.frame':	400 obs. of  4 variables:
 $ user_id     : int  1001 1002 1003 1003 1003 1003 1007 1007 1007 1007 ...
 $ product_type: int  1 2 3 4 5 1 2 3 4 5 ...
 $ pay_method  : chr  "1.현금" "2.직불카드" "3.신용카드" "3.신용카드" ...
 $ price       : num  153000 120000 780000 123000 79000 ...

In [20]:
summary(pay_data)

    user_id      product_type   pay_method            price
 Min.   :1001   Min.   :1.00   Length:400         Min.   :   172
 1st Qu.:1101   1st Qu.:2.00   Class :character   1st Qu.: 11654
 Median :1200   Median :3.00   Mode  :character   Median : 73518
 Mean   :1200   Mean   :3.13                      Mean   : 55993
 3rd Qu.:1300   3rd Qu.:4.00                      3rd Qu.: 86814
 Max.   :1398   Max.   :5.00                      Max.   :780000

In [21]:
table(pay_data$product_type)

  1   2   3   4   5
 55  82  89 104  70

In [ ]:
# 고객별 상품 유형에 따른 구매 금액과 합계를 나타내는 파생 변수